src/InformationRegisters/ДатыДляСозданияМФП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ДатыДляСозданияМФП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ДатыДляСозданияМФП/Ext/ManagerModule.bsl
Процедура Добавить(СсылкаНаДокумент, ДатаДокумента = Неопределено ) Экспорт
	
	Если ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаСоздания = НачалоДня(ДатаДокумента);
	Иначе
		ДатаСоздания = НачалоДня(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаДокумент, "Дата"));
	КонецЕсли;
	
	Если Не ПроведениеДокументовКлиентСервер.ИспользуютсяМФП(ДатаСоздания) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДатыДляСозданияМФП.ДатаСоздания
		|ИЗ
		|	РегистрСведений.ДатыДляСозданияМФП КАК ДатыДляСозданияМФП
		|ГДЕ
		|	ДатыДляСозданияМФП.ДатаСоздания = &ДатаСоздания";
	
	Запрос.УстановитьПараметр("ДатаСоздания", ДатаСоздания);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		 МЗ = РегистрыСведений.ДатыДляСозданияМФП.СоздатьМенеджерЗаписи();
		 МЗ.ДатаСоздания = ДатаСоздания;
		 МЗ.Документ	 = СсылкаНаДокумент;
		 МЗ.Записать();
	КонецЕсли;
	
КонецПроцедуры
